app/controllers/images_controller.rb

  def load_image
    @image = Image.find(params[:id])
---
SELECT * FROM `images` WHERE (`images`.`id` = 364) AND (`images`.`deleted_at` IS NULL)

  def create
    if @image.save
---
INSERT INTO `images` (`image_file_content_type`, `image_file_updated_at`, `deleted_at`, `image_file_file_name`, `image_file_file_size`, `snippet_id`) VALUES(NULL, NULL, NULL, NULL, NULL, NULL)

  def update
    if @image.update_attributes(params[:image])
---
UPDATE `images` SET `image_file_file_name` = 'woooo.jpg' WHERE `id` = 400

  def destroy
    if @image.destroy
---
DELETE FROM `images` WHERE `id` = 11