app/controllers/snippets_controller.rb

SELECT * FROM `snippets` WHERE (`snippets`.`deleted_at` IS NULL)
---
  def load_snippets
    @snippets = Snippet.all

SELECT * FROM `snippets` WHERE (`snippets`.`id` = 110) AND (`snippets`.`deleted_at` IS NULL)
---
  def load_snippet
    @snippet = Snippet.find(params[:id])

INSERT INTO `snippets` (`name`, `created_at`, `updated_at`, `deleted_at`, `description`) VALUES('foo', '2010-01-27 16:18:47', '2010-01-27 16:18:47', NULL, 'bar')
---
  def create
    if @snippet.save

UPDATE `snippets` SET `updated_at` = '2010-01-27 16:40:12', `name` = 'jiggy' WHERE `id` = 111
---
  def update
    if @snippet.update_attributes(params[:snippet])

DELETE FROM `snippets` WHERE `id` = 77
---
  def destroy
    if @snippet.destroy